# 公众号配置
# 公众号appId
app_id = "wxc0b88a073a0c048c"
# 公众号appSecret
app_secret = "ded8b104956254b98e038590fe686865"
# 模板消息id
# 每日消息
template_id1 = "Inn5o0ck3XCZvm8HO4qYjIYe4t73YnNeoVSIC1HMxYo"
# 课程消息,上课提醒
template_id2 = "oHf0CtjkUfYNM_AWUL7v5ZlMPKooLMK1dN2I3Z-w0Ug"
# 天气提醒
template_id3 = "AneQEpDysBwH3xHb1YlU05MGz8hqsFZAAHRpqeCQFmk"
# 接收公众号消息的微信号
# 这是openid
user = ["ofITE2LRLPbmzqCX4BbLXnpngxX0"]

# 提醒时间窗口 触发剩余时间小于该值 s
remain_time = 300

# gitee 配置
gitee_token = "54b7f137802f7b57d6952e81478d34e7"
gitee_owner = "jin-yuhao520"
gitee_repo  = "wx-images"

# 信息配置
# 所在城市
city = "Kuala Lumpur"
# 生日，如果月份或者日期小于10，直接用对应的数字即可，例如1997-1-1，---------倒计时
birthday = "2001-2-26"
# 在一起的日子，格式同上------------计时器
love_date = "2024-1-19"

# -------------------------------------------------------------------------
# 设置学期第一周开始日期
year = 2026
month = 2
day = 15
# 每日推送时间
post_Time = "07:30:00"
# 每节课提醒时间（有课才会提醒）, 时:分:秒  的形式, 字符串, 根据个人需要设置几次
time_table = ["07:40:00", "09:40:00", "13:40:00", "15:40:00", "18:40:00"]
# 课程时间
course_Time = ["8:00--9:45", "10:00--11:45", "14:00--15:45", "16:00--17:45", "19:00--20:45"]

# 提醒下雨
class_end_time = ["00:53:50", "01:39:30","08:00:00", "12:00:00", "17:00:00"]

# 课程（暂时不用）
import random
_phrases = [
    ['我', '爱', '你', '小', '宝', '宝'],
    ['你', '是', '我', '的', '宝', '贝'],
    ['每', '天', '都', '爱', '你', '哦'],
    ['想', '你', '想', '你', '想', '你'],
    ['你', '最', '漂', '亮', '了', '哦'],
    ['只', '喜', '欢', '你', '一', '人'],
    ['陪', '你', '到', '老', '好', '吗'],
    ['你', '笑', '起', '来', '真', '美'],
]
_week = [[*random.choice(_phrases)] for _ in range(7)]
classes = {str(i): [[*random.choice(_phrases)] for _ in range(7)] for i in range(1, 21)}

# 课程表 "1"代表第一周，依次类推，根据个人实际课表添加，有几周就添加几周,
# 每一行代表一天, 例如  ['', '编译原理', '', '数据库原理及应用', '数据分析原理', '']  代表周一
# classes = \
#     {
#         "1": [
#             ['', '编译原理', '', '数据库原理及应用', '数据分析原理', ''],
#             ['数据挖掘技术', '', '乒羽俱乐部3', '', '数据可视化', ''],
#             ['计算机网络', '', '编译原理', '数据库原理及应用', '', ''],
#             ['', '', '', '', '', ''],
#             ['', '计算机网络', '', '数据挖掘技术', '', ''],
#             ['6', '', '', '', '', ''],
#             ['6', '', '', '', '', '']
#         ],
#         "2": [
#             ['222', '', '编译原理', '', '数据分析原理', ''],
#             ['数据挖掘技术', '', '乒羽俱乐部3', '', '数据可视化', ''],
#             ['计算机网络', '', '编译原理', '数据库原理及应用', '', ''],
#             ['', '', '', '', '数据挖掘技术', '数据挖掘技术'],
#             ['', '计算机网络', '', '数据挖掘技术6', '', ''],
#             ['6', '', '', '', '数据库原理及应用', ''],
#             ['6', '', '', '', '', '']
#         ],
#         "3": [
#             ['333', '编译原理', '', '数据库原理及应用', '数据分析原理', ''],
#             ['数据挖掘技术', '', '乒羽俱乐部3', '', '数据可视化', ''],
#             ['计算机网络', '', '编译原理', '数据库原理及应用', '', ''],
#             ['', '', '', '', '数据挖掘实验', '数据挖掘实验'],
#             ['', '计算机网络', '', '数据挖掘技术', '', ''],
#             ['6', '', '', '', '', ''],
#             ['6', '', '', '', '', '']
#         ],
#         "4": [
#             ['', '编译原理', '', '数据库原理及应用', '数据分析原理', ''],
#             ['数据挖掘技术', '', '乒羽俱乐部3', '', '数据可视化', ''],
#             ['计算机网络', '', '编译原理', '数据库原理及应用', '', ''],
#             ['', '', '', '', '数据挖掘实验', '数据挖掘实验'],
#             ['', '计算机网络', '', '数据挖掘技术', '', ''],
#             ['6', '', '', '', '', ''],
#             ['6', '', '', '', '', '']
#         ],
#     }

# 模板 1：每日提醒模板
# 本周是开学的第: {{weeks.DATA}} 周
# 今天是: {{date.DATA}}
# 城市： {{city.DATA}}
# 天气： {{weather.DATA}}
# 最低气温: {{min_temperature.DATA}}
# 最高气温: {{max_temperature.DATA}}
# 今天是破壳日的第: {{birthday.DATA}} 天
# 距离开学还有: {{birthday.DATA}} 天
'''
----------------今日天气---------------- 
🌏️今天是： {{date.DATA}} 
🗺️城  市： {{city.DATA}} 
⛺️天  气： {{weather.DATA}} 
🏞️最低温： {{min_temperature.DATA}} 
🏝️最高温： {{max_temperature.DATA}} 
----------------今日课程---------------- 
1️⃣第一节： {{firstClass.DATA}} 
2️⃣第二节： {{secondClass.DATA}} 
3️⃣第三节： {{thirdClass.DATA}} 
4️⃣第四节： {{fourthClass.DATA}} 
5️⃣第五节： {{fifthClass.DATA}} 
6️⃣第六节： {{sixthClass.DATA}} 
---------------------------------------- 
🤴Kim💖Chua👸 👆️点击看图片👆️
'''

'''
⚡当前天气： {{weather_desc.DATA}} 
🌡️当前温度： {{cur_tmeperature.DATA}}℃ 
💧今日降水： {{precip.DATA}}mm 
⭐️我有话说： 小宝不要淋湿了！哼哼！
'''

# ----------------今日课程----------------
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}
# 第五讲: {{fifthClass.DATA}}
# 第六讲: {{sixthClass.DATA}}

# 模板 2 课程单推
# 课程信息: {{classInfo.DATA}}

# 模板 3 晚安心语推送和第二天课程推送
# {{goodNight.DATA}}
# ----------------明日课程----------------
# 明天是: {{week.DATA}}
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}
# 第五讲: {{fifthClass.DATA}}
# 第六讲: {{sixthClass.DATA}}

# emoji: https://emoji6.com/emojiall/en













